// Задача 3.
// a. Да се декларира променлива count на која што ќе и доделите нумеричка вредност 5. Користете јамка (while) за да ги испечатите броевите од count надолу до 1.

// б. Напишете програма што одбројува од 10 до 1. Користете јамка do-while и вклучете услов да излезе од циклусот кога одбројувањето ќе достигне 5. Испечатете го секој број во конзолата.

//a
let count = 5;

while (count <= 5 && count >= 1) {
  console.log(count);
  count--;
}

//b
let num = 10;

do {
  if (num >= 5) {
    console.log(num);
  }
  num--;
} while (num <= 10 && num >= 1);
